#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_acm_certificate.resume: Refreshing state... [id=arn:aws:acm:us-east-1:085879623427:certificate/2ca2a373-e4f8-4651-b6f1-772b2d031932]
aws_cloudfront_origin_access_control.resume: Refreshing state... [id=EDLCUHWWEP6SJ]
aws_route53_zone.davidbornitz_dev: Refreshing state... [id=Z0139625NTMWYZJ47N1B]
aws_s3_bucket.resume: Refreshing state... [id=dbornitz-resume]
aws_route53_record.resume_validation["*.davidbornitz.dev"]: Refreshing state... [id=Z0139625NTMWYZJ47N1B__b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev._CNAME]
aws_s3_bucket_website_configuration.resume: Refreshing state... [id=dbornitz-resume]
aws_s3_bucket_public_access_block.resume: Refreshing state... [id=dbornitz-resume]
aws_s3_object.resume_website["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.resume_website["styles.css"]: Refreshing state... [id=styles.css]
aws_acm_certificate_validation.resume: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.allow_cloudfront_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_cloudfront_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::dbornitz-resume/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.resume will be created
  + resource "aws_cloudfront_distribution" "resume" {
      + aliases                         = [
          + "resume.davidbornitz.dev",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "resume"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "dbornitz-resume.s3.us-east-2.amazonaws.com"
          + origin_access_control_id = "EDLCUHWWEP6SJ"
          + origin_id                = "resume"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:085879623427:certificate/2ca2a373-e4f8-4651-b6f1-772b2d031932"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_route53_record.resume will be created
  + resource "aws_route53_record" "resume" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "resume.davidbornitz.dev"
      + type            = "A"
      + zone_id         = "Z0139625NTMWYZJ47N1B"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_s3_bucket_policy.allow_cloudfront_access will be created
  + resource "aws_s3_bucket_policy" "allow_cloudfront_access" {
      + bucket = "dbornitz-resume"
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @davidbornitz, Action: `pull_request`*